#+startup:fold
* estimate of the number of mu+ reconstructed per hour with nominal collimator position      
#+begin_src maxima :results output graphics :exports both :tangle yes
nppp                 : 1.6e7 ;                 /* number of protons per pulse */
nmum_per_pot         : 1.6e-3;                 /* mu- stopping rate */
nmum_stops_per_pulse : nppp*nmum_per_pot;
nmup_stops_per_pulse : nppp*nmum_per_pot*4e-3;
/*                                                                    */
/*              now : estimate the rate                               */
eff                  : 0.1;                    /* reco efficiency at 0.5 T*/
f_int                : 1e-3;                   /* beam intensity reduced by this f_int */
npulses_per_sec      : (1/1.695e-6)*0.4/1.4 ;  /* average pulse rate, account for beam-off */

nreco_per_hour       : nmup_stops_per_pulse*eff*f_int*npulses_per_sec*3600;

print("nmum_stops_per_pulse : ",nmum_stops_per_pulse);
print("nmup_stops_per_pulse : ",nmup_stops_per_pulse);
print("npulses_per_sec      : ",npulses_per_sec);
print("nreco_per_hour       : ",nreco_per_hour );
#+end_src

#+RESULTS:
: nmum_stops_per_pulse :  25600.0 
: nmup_stops_per_pulse :  102.4 
: npulses_per_sec      :  168563.0004214075 
: nreco_per_hour       :  6213906.447534768 

* muon CM momentum in pi --> nu nu decay : 29.8 MeV/c                        
#+begin_src maxima :results output graphics :exports both :tangle yes
  mpi : 139.6;
  mmu : 105.6;
  pmu : (mpi^2-mmu^2)/(2*mpi);
  print("pmu : ",pmu);
#+end_src

#+RESULTS:
: pmu :  29.8595988538682 

* muon decays in flight - estimate the integral using two different fits:    

  fit the cos(theta) band bins 51:85 (0 - 0.71), approx tan(pitch) > 1 , of the histogram

  su2020.bmum0s5bb0.spmc_ana.0000.hist / murat_SpmcAna / spmc_1/cth_vs_mom_1
  
#+begin_src maxima :results output
f : exp(35.07-0.3656*x) ;                        /* log-likelihood fit */
s : float(integrate(f, x,103.5, 105.));
print("s  (log-likelihood fit): ",s);

f1 : exp(28.61-0.2948*x) ;                       /* chi2 fit */
s1 : float(integrate(f1, x,103.5, 105.));
print("s1 (chi2 fit)          : ", s1);

resampling_factor : 1.e3 ;                       /* the dataset resampled by x1000 */
npot              : 4e19 ;
extinction        : 1e-10;
ngenerated        : 1.e9 ;
sum : (npot/(ngenerated*resampling_factor))*extinction*s1;
print("sum                    : ",sum);
#+end_src

#+RESULTS:
: s  (log-likelihood fit):  0.07237928004987149 
: s1 (chi2 fit)          :  0.1809923357926502 
: sum                    :  7.239693431706008e-4 

the upper limit on the contribution of muon decays in flight is then 1.e-3
* muon scattering in the ST                                                  

  fit the cos(theta) band bins 51:85 (0 - 0.71), approx tan(pitch) > 1 , of the histogram

  su2020.bmum0s5ab0.spmc_ana.0000.hist / murat_SpmcAna / spmc_3/cth_vs_mom_1

  with a flat function in the range 100-110 MeV/c
  
#+begin_src maxima :results output
f : 1.0        ;                                 /* binned log likelihood fit */
s : float(integrate(f, x,103.5, 105.));
print("s  (log-likelihood fit): ",s);

f1 : 1.5 ;                                       /* chi2 fit */
s1 : float(integrate(f1, x,103.5, 105.));
print("s1 (chi2 fit)          : ", s1);

resampling_factor : 1.e4 ;                       /* the dataset resampled by x1e4 */
npot              : 4e19 ;
extinction        : 1e-10;
ngenerated        : 1.e9 ;
p_misid           : 1.e-2;
sum               : s1*(npot/(ngenerated*resampling_factor))*extinction*p_misid;
print("sum                    : ",sum);
#+end_src

#+RESULTS:
: s  (log-likelihood fit):  1.5 
: s1 (chi2 fit)          :  2.25 
: sum                    :  9.0e-6 

